ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f2838x_mcan_regs.xml
<module id="MCAN_REGS" HW_revision="" description="MCAN Registers">
	<register id="MCAN_CREL" width="32" page="1" offset="0x0" internal="0" description="MCAN Core Release Register">
		<bitfield id="DAY" description="Time Stamp Day" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="MON" description="Time Stamp Month" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="YEAR" description="Time Stamp Year" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="SUBSTEP" description="Sub-Step of Core Release" begin="23" end="20" width="4" rwaccess="R"/>
		<bitfield id="STEP" description="Step of Core Release" begin="27" end="24" width="4" rwaccess="R"/>
		<bitfield id="REL" description="Core Release" begin="31" end="28" width="4" rwaccess="R"/>
	</register>
	<register id="MCAN_ENDN" width="32" page="1" offset="0x4" internal="0" description="MCAN Endian Register">
		<bitfield id="ETV" description="Endianess Test Value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MCAN_DBTP" width="32" page="1" offset="0xC" internal="0" description="MCAN Data Bit Timing and Prescaler Register">
		<bitfield id="DSJW" description="Data Resynchronization Jump Width" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="DTSEG2" description="Data Time Segment After Sample Point" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="DTSEG1" description="Data Time Segment Before Sample Point" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="DBRP" description="Data Bit Rate Prescaler" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="TDC" description="Transmitter Delay Compensation" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_TEST" width="32" page="1" offset="0x10" internal="0" description="MCAN Test Register">
		<bitfield id="LBCK" description="Loop Back Mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TX" description="Control of Transmit Pin" begin="6" end="5" width="2" rwaccess="RW"/>
		<bitfield id="RX" description="Receive Pin" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_RWD" width="32" page="1" offset="0x14" internal="0" description="MCAN RAM Watchdog">
		<bitfield id="WDC" description="Watchdog Configuration" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="WDV" description="Watchdog Value" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="MCAN_CCCR" width="32" page="1" offset="0x18" internal="0" description="MCAN CC Control Register">
		<bitfield id="INIT" description="Initialization" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CCE" description="Configuration Change Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ASM" description="Restricted Operation Mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CSA" description="Clock Stop Acknowledge" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CSR" description="Clock Stop Request" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MON" description="Bus Monitoring Mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DAR" description="Disable Automatic Retransmission" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TEST" description="Test Mode Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="FDOE" description="Flexible Datarate Operation Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="BRSE" description="Bit Rate Switch Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PXHD" description="Protocol Exception Handling Disable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EFBI" description="Edge Filtering During Bus Integration" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TXP" description="Transmit Pause" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="NISO" description="Non-ISO Operation" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_NBTP" width="32" page="1" offset="0x1C" internal="0" description="MCAN Nominal Bit Timing and Prescaler Register">
		<bitfield id="NTSEG2" description="Nominal Time Segment After Sample Point" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="NTSEG1" description="Nominal Time Segment Before Sample Point" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="NBRP" description="Nominal Bit Rate Prescaler" begin="24" end="16" width="9" rwaccess="RW"/>
		<bitfield id="NSJW" description="Nominal (Re)Synchronization Jump Width" begin="31" end="25" width="7" rwaccess="RW"/>
	</register>
	<register id="MCAN_TSCC" width="32" page="1" offset="0x20" internal="0" description="MCAN Timestamp Counter Configuration">
		<bitfield id="TSS" description="Timestamp Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TCP" description="Timestamp Counter Prescaler" begin="19" end="16" width="4" rwaccess="RW"/>
	</register>
	<register id="MCAN_TSCV" width="32" page="1" offset="0x24" internal="0" description="MCAN Timestamp Counter Value">
		<bitfield id="TSC" description="Timestamp Counter" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MCAN_TOCC" width="32" page="1" offset="0x28" internal="0" description="MCAN Timeout Counter Configuration">
		<bitfield id="ETOC" description="Enable Timeout Counter" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TOS" description="Timeout Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="TOP" description="Timeout Period" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MCAN_TOCV" width="32" page="1" offset="0x2C" internal="0" description="MCAN Timeout Counter Value">
		<bitfield id="TOC" description="Timeout Counter" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MCAN_ECR" width="32" page="1" offset="0x40" internal="0" description="MCAN Error Counter Register">
		<bitfield id="TEC" description="Transmit Error Counter" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="REC" description="Receive Error Counter" begin="14" end="8" width="7" rwaccess="R"/>
		<bitfield id="RP" description="Receive Error Passive" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CEL" description="CAN Error Logging" begin="23" end="16" width="8" rwaccess="R"/>
	</register>
	<register id="MCAN_PSR" width="32" page="1" offset="0x44" internal="0" description="MCAN Protocol Status Register">
		<bitfield id="LEC" description="Last Error Code" begin="2" end="0" width="3" rwaccess="R"/>
		<bitfield id="ACT" description="Node Activity" begin="4" end="3" width="2" rwaccess="R"/>
		<bitfield id="EP" description="Error Passive" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EW" description="Warning Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="BO" description="Bus_Off Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="DLEC" description="Data Phase Last Error Code" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="RESI" description="ESI Flag of Last Received CAN FD Message" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="RBRS" description="BRS Flag of Last Received CAN FD Message" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="RFDF" description="Received a CAN FD Message" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="PXE" description="Protocol Exception Event" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="TDCV" description="Transmitter Delay Compensation Value" begin="22" end="16" width="7" rwaccess="R"/>
	</register>
	<register id="MCAN_TDCR" width="32" page="1" offset="0x48" internal="0" description="MCAN Transmitter Delay Compensation Register">
		<bitfield id="TDCF" description="Transmitter Delay Compensation Filter Window Length" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="TDCO" description="Transmitter Delay Compensation Offset" begin="14" end="8" width="7" rwaccess="RW"/>
	</register>
	<register id="MCAN_IR" width="32" page="1" offset="0x50" internal="0" description="MCAN Interrupt Register">
		<bitfield id="RF0N" description="Rx FIFO 0 New Message" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RF0W" description="Rx FIFO 0 Watermark Reached" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RF0F" description="Rx FIFO 0 Full" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RF0L" description="Rx FIFO 0 Message Lost" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RF1N" description="Rx FIFO 1 New Message" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RF1W" description="Rx FIFO 1 Watermark Reached" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RF1F" description="Rx FIFO 1 Full" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RF1L" description="Rx FIFO 1 Message Lost" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="HPM" description="High Priority Message" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TC" description="Transmission Completed" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TCF" description="Transmission Cancellation Finished" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TFE" description="Tx FIFO Empty" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TEFN" description="Tx Event FIFO New Entry" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="TEFW" description="Tx Event FIFO Watermark Reached" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TEFF" description="Tx Event FIFO Full" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TEFL" description="Tx Event FIFO Element Lost" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TSW" description="Timestamp Wraparound" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MRAF" description="Message RAM Access Failure" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="TOO" description="Timeout Occurred" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="DRX" description="Message Stored to Dedicated Rx Buffer" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="BEU" description="Bit Error Uncorrected" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ELO" description="Error Logging Overflow" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="EP" description="Error Passive" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="EW" description="Warning Status" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="BO" description="Bus_Off Status" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="WDI" description="Watchdog Interrupt" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PEA" description="Protocol Error in Arbitration Phase" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PED" description="Protocol Error in Data Phase" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ARA" description="Access to Reserved Address" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
