ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f2838x_mcan_regs.xml
	<register id="MCAN_IE" width="32" page="1" offset="0x54" internal="0" description="MCAN Interrupt Enable">
		<bitfield id="RF0NE" description="Rx FIFO 0 New Message Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RF0WE" description="Rx FIFO 0 Watermark Reached Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RF0FE" description="Rx FIFO 0 Full Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RF0LE" description="Rx FIFO 0 Message Lost Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RF1NE" description="Rx FIFO 1 New Message Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RF1WE" description="Rx FIFO 1 Watermark Reached Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RF1FE" description="Rx FIFO 1 Full Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RF1LE" description="Rx FIFO 1 Message Lost Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="HPME" description="High Priority Message Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TCE" description="Transmission Completed Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TCFE" description="Transmission Cancellation Finished Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TFEE" description="Tx FIFO Empty Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TEFNE" description="Tx Event FIFO New Entry Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="TEFWE" description="Tx Event FIFO Watermark Reached Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TEFFE" description="Tx Event FIFO Full Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TEFLE" description="Tx Event FIFO Element Lost Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TSWE" description="Timestamp Wraparound Enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MRAFE" description="Message RAM Access Failure Enable" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="TOOE" description="Timeout Occurred Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="DRXE" description="Message Stored to Dedicated Rx Buffer Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="BECE" description="Bit Error Corrected Enable" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="BEUE" description="Bit Error Uncorrected Enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ELOE" description="Error Logging Overflow Enable" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="EPE" description="Error Passive Enable" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="EWE" description="Warning Status Enable" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="BOE" description="Bus_Off Status Enable" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="WDIE" description="Watchdog Interrupt Enable" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PEAE" description="Protocol Error in Arbitration Phase Enable" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PEDE" description="Protocol Error in Data Phase Enable" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ARAE" description="Access to Reserved Address Enable" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_ILS" width="32" page="1" offset="0x58" internal="0" description="MCAN Interrupt Line Select">
		<bitfield id="RF0NL" description="Rx FIFO 0 New Message Line" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RF0WL" description="Rx FIFO 0 Watermark Reached Line" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RF0FL" description="Rx FIFO 0 Full Line" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RF0LL" description="Rx FIFO 0 Message Lost Line" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RF1NL" description="Rx FIFO 1 New Message Line" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RF1WL" description="Rx FIFO 1 Watermark Reached Line" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RF1FL" description="Rx FIFO 1 Full Line" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RF1LL" description="Rx FIFO 1 Message Lost Line" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="HPML" description="High Priority Message Line" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TCL" description="Transmission Completed Line" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TCFL" description="Transmission Cancellation Finished Line" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TFEL" description="Tx FIFO Empty Line" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TEFNL" description="Tx Event FIFO New Entry Line" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="TEFWL" description="Tx Event FIFO Watermark Reached Line" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TEFFL" description="Tx Event FIFO Full Line" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TEFLL" description="Tx Event FIFO Element Lost Line" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TSWL" description="Timestamp Wraparound Line" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MRAFL" description="Message RAM Access Failure Line" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="TOOL" description="Timeout Occurred Line" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="DRXL" description="Message Stored to Dedicated Rx Buffer Line" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="BECL" description="Bit Error Corrected Line" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="BEUL" description="Bit Error Uncorrected Line" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ELOL" description="Error Logging Overflow Line" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="EPL" description="Error Passive Line" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="EWL" description="Warning Status Line" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="BOL" description="Bus_Off Status Line" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="WDIL" description="Watchdog Interrupt Line" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PEAL" description="Protocol Error in Arbitration Phase Line" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PEDL" description="Protocol Error in Data Phase Line" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ARAL" description="Access to Reserved Address Line" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_ILE" width="32" page="1" offset="0x5C" internal="0" description="MCAN Interrupt Line Enable">
		<bitfield id="EINT0" description="Enable Interrupt Line 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EINT1" description="Enable Interrupt Line 1" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_GFC" width="32" page="1" offset="0x80" internal="0" description="MCAN Global Filter Configuration">
		<bitfield id="RRFE" description="Reject Remote Frames Extended" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RRFS" description="Reject Remote Frames Standard" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ANFE" description="Accept Non-matching Frames Extended" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="ANFS" description="Accept Non-matching Frames Standard" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="MCAN_SIDFC" width="32" page="1" offset="0x84" internal="0" description="MCAN Standard ID Filter Configuration">
		<bitfield id="FLSSA" description="Filter List Standard Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="LSS" description="List Size Standard" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="MCAN_XIDFC" width="32" page="1" offset="0x88" internal="0" description="MCAN Extended ID Filter Configuration">
		<bitfield id="FLESA" description="Filter List Extended Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="LSE" description="List Size Extended" begin="22" end="16" width="7" rwaccess="RW"/>
	</register>
	<register id="MCAN_XIDAM" width="32" page="1" offset="0x90" internal="0" description="MCAN Extended ID and Mask">
		<bitfield id="EIDM" description="Extended ID Mask" begin="28" end="0" width="29" rwaccess="RW"/>
	</register>
	<register id="MCAN_HPMS" width="32" page="1" offset="0x94" internal="0" description="MCAN High Priority Message Status">
		<bitfield id="BIDX" description="Buffer Index" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="MSI" description="Message Storage Indicator" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="FIDX" description="Filter Index" begin="14" end="8" width="7" rwaccess="R"/>
		<bitfield id="FLST" description="Filter List" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_NDAT1" width="32" page="1" offset="0x98" internal="0" description="MCAN New Data 1">
		<bitfield id="ND0" description="New Data RX Buffer 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ND1" description="New Data RX Buffer 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ND2" description="New Data RX Buffer 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ND3" description="New Data RX Buffer 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ND4" description="New Data RX Buffer 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ND5" description="New Data RX Buffer 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ND6" description="New Data RX Buffer 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ND7" description="New Data RX Buffer 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ND8" description="New Data RX Buffer 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ND9" description="New Data RX Buffer 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ND10" description="New Data RX Buffer 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ND11" description="New Data RX Buffer 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ND12" description="New Data RX Buffer 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ND13" description="New Data RX Buffer 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ND14" description="New Data RX Buffer 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ND15" description="New Data RX Buffer 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ND16" description="New Data RX Buffer 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ND17" description="New Data RX Buffer 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ND18" description="New Data RX Buffer 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ND19" description="New Data RX Buffer 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ND20" description="New Data RX Buffer 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ND21" description="New Data RX Buffer 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ND22" description="New Data RX Buffer 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ND23" description="New Data RX Buffer 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="ND24" description="New Data RX Buffer 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="ND25" description="New Data RX Buffer 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="ND26" description="New Data RX Buffer 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ND27" description="New Data RX Buffer 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ND28" description="New Data RX Buffer 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ND29" description="New Data RX Buffer 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ND30" description="New Data RX Buffer 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ND31" description="New Data RX Buffer 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
