ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f2838x_mcan_regs.xml
	<register id="MCAN_NDAT2" width="32" page="1" offset="0x9C" internal="0" description="MCAN New Data 2">
		<bitfield id="ND32" description="New Data RX Buffer 32" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ND33" description="New Data RX Buffer 33" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ND34" description="New Data RX Buffer 34" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ND35" description="New Data RX Buffer 35" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ND36" description="New Data RX Buffer 36" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ND37" description="New Data RX Buffer 37" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ND38" description="New Data RX Buffer 38" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ND39" description="New Data RX Buffer 39" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ND40" description="New Data RX Buffer 40" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ND41" description="New Data RX Buffer 41" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ND42" description="New Data RX Buffer 42" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ND43" description="New Data RX Buffer 43" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ND44" description="New Data RX Buffer 44" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ND45" description="New Data RX Buffer 45" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ND46" description="New Data RX Buffer 46" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ND47" description="New Data RX Buffer 47" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ND48" description="New Data RX Buffer 48" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ND49" description="New Data RX Buffer 49" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ND50" description="New Data RX Buffer 50" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ND51" description="New Data RX Buffer 51" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ND52" description="New Data RX Buffer 52" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ND53" description="New Data RX Buffer 53" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ND54" description="New Data RX Buffer 54" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ND55" description="New Data RX Buffer 55" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="ND56" description="New Data RX Buffer 56" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="ND57" description="New Data RX Buffer 57" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="ND58" description="New Data RX Buffer 58" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ND59" description="New Data RX Buffer 59" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ND60" description="New Data RX Buffer 60" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ND61" description="New Data RX Buffer 61" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ND62" description="New Data RX Buffer 62" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ND63" description="New Data RX Buffer 63" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXF0C" width="32" page="1" offset="0xA0" internal="0" description="MCAN Rx FIFO 0 Configuration">
		<bitfield id="F0SA" description="Rx FIFO 0 Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="F0S" description="Rx FIFO 0 Size" begin="22" end="16" width="7" rwaccess="RW"/>
		<bitfield id="F0WM" description="Rx FIFO 0 Watermark" begin="30" end="24" width="7" rwaccess="RW"/>
		<bitfield id="F0OM" description="FIFO 0 Operation Mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXF0S" width="32" page="1" offset="0xA4" internal="0" description="MCAN Rx FIFO 0 Status">
		<bitfield id="F0FL" description="Rx FIFO 0 Fill Level" begin="6" end="0" width="7" rwaccess="R"/>
		<bitfield id="F0GI" description="Rx FIFO 0 Get Index" begin="13" end="8" width="6" rwaccess="R"/>
		<bitfield id="F0PI" description="Rx FIFO 0 Put Index" begin="21" end="16" width="6" rwaccess="R"/>
		<bitfield id="F0F" description="Rx FIFO 0 Full" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="RF0L" description="Rx FIFO 0 Message Lost" begin="25" end="25" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_RXF0A" width="32" page="1" offset="0xA8" internal="0" description="MCAN Rx FIFO 0 Acknowledge">
		<bitfield id="F0AI" description="Rx FIFO 0 Acknowledge Index" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXBC" width="32" page="1" offset="0xAC" internal="0" description="MCAN Rx Buffer Configuration">
		<bitfield id="RBSA" description="Rx Buffer Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXF1C" width="32" page="1" offset="0xB0" internal="0" description="MCAN Rx FIFO 1 Configuration">
		<bitfield id="F1SA" description="Rx FIFO 1 Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="F1S" description="Rx FIFO 1 Size" begin="22" end="16" width="7" rwaccess="RW"/>
		<bitfield id="F1WM" description="Rx FIFO 1 Watermark" begin="30" end="24" width="7" rwaccess="RW"/>
		<bitfield id="F1OM" description="FIFO 1 Operation Mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXF1S" width="32" page="1" offset="0xB4" internal="0" description="MCAN Rx FIFO 1 Status">
		<bitfield id="F1FL" description="Rx FIFO 1 Fill Level" begin="6" end="0" width="7" rwaccess="R"/>
		<bitfield id="F1GI" description="Rx FIFO 1 Get Index" begin="13" end="8" width="6" rwaccess="R"/>
		<bitfield id="F1PI" description="Rx FIFO 1 Put Index" begin="21" end="16" width="6" rwaccess="R"/>
		<bitfield id="F1F" description="Rx FIFO 1 Full" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="RF1L" description="Rx FIFO 1 Message Lost" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="DMS" description="Debug Message Status" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="MCAN_RXF1A" width="32" page="1" offset="0xB8" internal="0" description="MCAN Rx FIFO 1 Acknowledge">
		<bitfield id="F1AI" description="Rx FIFO 1 Acknowledge Index" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXESC" width="32" page="1" offset="0xBC" internal="0" description="MCAN Rx Buffer / FIFO Element Size Configuration">
		<bitfield id="F0DS" description="Rx FIFO 0 Data Field Size" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="F1DS" description="Rx FIFO 1 Data Field Size" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="RBDS" description="Rx Buffer Data Field Size" begin="10" end="8" width="3" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXBC" width="32" page="1" offset="0xC0" internal="0" description="MCAN Tx Buffer Configuration">
		<bitfield id="TBSA" description="Tx Buffers Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="NDTB" description="Number of Dedicated Transmit Buffers" begin="21" end="16" width="6" rwaccess="RW"/>
		<bitfield id="TFQS" description="Transmit FIFO/Queue Size" begin="29" end="24" width="6" rwaccess="RW"/>
		<bitfield id="TFQM" description="Tx FIFO/Queue Mode" begin="30" end="30" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXFQS" width="32" page="1" offset="0xC4" internal="0" description="MCAN Tx FIFO / Queue Status">
		<bitfield id="TFFL" description="Tx FIFO Free Level" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="TFGI" description="Tx FIFO Get Index" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="TFQP" description="Tx FIFO/Queue Put Index" begin="20" end="16" width="5" rwaccess="R"/>
		<bitfield id="TFQF" description="Tx FIFO/Queue Full" begin="21" end="21" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_TXESC" width="32" page="1" offset="0xC8" internal="0" description="MCAN Tx Buffer Element Size Configuration">
		<bitfield id="TBDS" description="Tx Buffer Data Field Size" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXBRP" width="32" page="1" offset="0xCC" internal="0" description="MCAN Tx Buffer Request Pending">
		<bitfield id="TRP0" description="Transmission Request Pending 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="TRP1" description="Transmission Request Pending 1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="TRP2" description="Transmission Request Pending 2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="TRP3" description="Transmission Request Pending 3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="TRP4" description="Transmission Request Pending 4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="TRP5" description="Transmission Request Pending 5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="TRP6" description="Transmission Request Pending 6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="TRP7" description="Transmission Request Pending 7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="TRP8" description="Transmission Request Pending 8" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="TRP9" description="Transmission Request Pending 9" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="TRP10" description="Transmission Request Pending 10" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="TRP11" description="Transmission Request Pending 11" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="TRP12" description="Transmission Request Pending 12" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="TRP13" description="Transmission Request Pending 13" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="TRP14" description="Transmission Request Pending 14" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="TRP15" description="Transmission Request Pending 15" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="TRP16" description="Transmission Request Pending 16" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="TRP17" description="Transmission Request Pending 17" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="TRP18" description="Transmission Request Pending 18" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="TRP19" description="Transmission Request Pending 19" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="TRP20" description="Transmission Request Pending 20" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="TRP21" description="Transmission Request Pending 21" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="TRP22" description="Transmission Request Pending 22" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="TRP23" description="Transmission Request Pending 23" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="TRP24" description="Transmission Request Pending 24" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="TRP25" description="Transmission Request Pending 25" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="TRP26" description="Transmission Request Pending 26" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="TRP27" description="Transmission Request Pending 27" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="TRP28" description="Transmission Request Pending 28" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="TRP29" description="Transmission Request Pending 29" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="TRP30" description="Transmission Request Pending 30" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="TRP31" description="Transmission Request Pending 31" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_TXBAR" width="32" page="1" offset="0xD0" internal="0" description="MCAN Tx Buffer Add Request">
		<bitfield id="AR0" description="Add Request 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="AR1" description="Add Request 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="AR2" description="Add Request 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="AR3" description="Add Request 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="AR4" description="Add Request 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="AR5" description="Add Request 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="AR6" description="Add Request 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AR7" description="Add Request 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="AR8" description="Add Request 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="AR9" description="Add Request 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="AR10" description="Add Request 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="AR11" description="Add Request 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="AR12" description="Add Request 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="AR13" description="Add Request 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="AR14" description="Add Request 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="AR15" description="Add Request 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="AR16" description="Add Request 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="AR17" description="Add Request 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="AR18" description="Add Request 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="AR19" description="Add Request 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="AR20" description="Add Request 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="AR21" description="Add Request 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="AR22" description="Add Request 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="AR23" description="Add Request 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="AR24" description="Add Request 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="AR25" description="Add Request 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="AR26" description="Add Request 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="AR27" description="Add Request 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="AR28" description="Add Request 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="AR29" description="Add Request 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="AR30" description="Add Request 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="AR31" description="Add Request 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
