ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f2838x_mcan_regs.xml
	<register id="MCAN_TXBCR" width="32" page="1" offset="0xD4" internal="0" description="MCAN Tx Buffer Cancellation Request">
		<bitfield id="CR0" description="Cancellation Request 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CR1" description="Cancellation Request 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CR2" description="Cancellation Request 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CR3" description="Cancellation Request 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CR4" description="Cancellation Request 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CR5" description="Cancellation Request 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CR6" description="Cancellation Request 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CR7" description="Cancellation Request 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CR8" description="Cancellation Request 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CR9" description="Cancellation Request 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CR10" description="Cancellation Request 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CR11" description="Cancellation Request 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CR12" description="Cancellation Request 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CR13" description="Cancellation Request 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CR14" description="Cancellation Request 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CR15" description="Cancellation Request 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CR16" description="Cancellation Request 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CR17" description="Cancellation Request 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CR18" description="Cancellation Request 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CR19" description="Cancellation Request 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CR20" description="Cancellation Request 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CR21" description="Cancellation Request 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CR22" description="Cancellation Request 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CR23" description="Cancellation Request 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CR24" description="Cancellation Request 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CR25" description="Cancellation Request 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CR26" description="Cancellation Request 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CR27" description="Cancellation Request 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CR28" description="Cancellation Request 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CR29" description="Cancellation Request 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CR30" description="Cancellation Request 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CR31" description="Cancellation Request 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXBTO" width="32" page="1" offset="0xD8" internal="0" description="MCAN Tx Buffer Transmission Occurred">
		<bitfield id="TO0" description="Transmission Occurred 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="TO1" description="Transmission Occurred 1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="TO2" description="Transmission Occurred 2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="TO3" description="Transmission Occurred 3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="TO4" description="Transmission Occurred 4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="TO5" description="Transmission Occurred 5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="TO6" description="Transmission Occurred 6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="TO7" description="Transmission Occurred 7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="TO8" description="Transmission Occurred 8" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="TO9" description="Transmission Occurred 9" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="TO10" description="Transmission Occurred 10" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="TO11" description="Transmission Occurred 11" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="TO12" description="Transmission Occurred 12" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="TO13" description="Transmission Occurred 13" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="TO14" description="Transmission Occurred 14" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="TO15" description="Transmission Occurred 15" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="TO16" description="Transmission Occurred 16" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="TO17" description="Transmission Occurred 17" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="TO18" description="Transmission Occurred 18" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="TO19" description="Transmission Occurred 19" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="TO20" description="Transmission Occurred 20" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="TO21" description="Transmission Occurred 21" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="TO22" description="Transmission Occurred 22" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="TO23" description="Transmission Occurred 23" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="TO24" description="Transmission Occurred 24" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="TO25" description="Transmission Occurred 25" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="TO26" description="Transmission Occurred 26" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="TO27" description="Transmission Occurred 27" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="TO28" description="Transmission Occurred 28" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="TO29" description="Transmission Occurred 29" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="TO30" description="Transmission Occurred 30" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="TO31" description="Transmission Occurred 31" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_TXBCF" width="32" page="1" offset="0xDC" internal="0" description="MCAN Tx Buffer Cancellation Finished">
		<bitfield id="CF0" description="Cancellation Finished 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CF1" description="Cancellation Finished 1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CF2" description="Cancellation Finished 2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CF3" description="Cancellation Finished 3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CF4" description="Cancellation Finished 4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CF5" description="Cancellation Finished 5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CF6" description="Cancellation Finished 6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CF7" description="Cancellation Finished 7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CF8" description="Cancellation Finished 8" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CF9" description="Cancellation Finished 9" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CF10" description="Cancellation Finished 10" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CF11" description="Cancellation Finished 11" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CF12" description="Cancellation Finished 12" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="CF13" description="Cancellation Finished 13" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CF14" description="Cancellation Finished 14" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CF15" description="Cancellation Finished 15" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CF16" description="Cancellation Finished 16" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CF17" description="Cancellation Finished 17" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CF18" description="Cancellation Finished 18" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CF19" description="Cancellation Finished 19" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CF20" description="Cancellation Finished 20" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CF21" description="Cancellation Finished 21" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CF22" description="Cancellation Finished 22" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CF23" description="Cancellation Finished 23" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="CF24" description="Cancellation Finished 24" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="CF25" description="Cancellation Finished 25" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="CF26" description="Cancellation Finished 26" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="CF27" description="Cancellation Finished 27" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="CF28" description="Cancellation Finished 28" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="CF29" description="Cancellation Finished 29" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="CF30" description="Cancellation Finished 30" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CF31" description="Cancellation Finished 31" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_TXBTIE" width="32" page="1" offset="0xE0" internal="0" description="MCAN Tx Buffer Transmission Interrupt Enable">
		<bitfield id="TIE0" description="Transmission Interrupt Enable 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TIE1" description="Transmission Interrupt Enable 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TIE2" description="Transmission Interrupt Enable 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TIE3" description="Transmission Interrupt Enable 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TIE4" description="Transmission Interrupt Enable 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TIE5" description="Transmission Interrupt Enable 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TIE6" description="Transmission Interrupt Enable 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TIE7" description="Transmission Interrupt Enable 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TIE8" description="Transmission Interrupt Enable 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TIE9" description="Transmission Interrupt Enable 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TIE10" description="Transmission Interrupt Enable 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TIE11" description="Transmission Interrupt Enable 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TIE12" description="Transmission Interrupt Enable 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="TIE13" description="Transmission Interrupt Enable 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TIE14" description="Transmission Interrupt Enable 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TIE15" description="Transmission Interrupt Enable 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TIE16" description="Transmission Interrupt Enable 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="TIE17" description="Transmission Interrupt Enable 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="TIE18" description="Transmission Interrupt Enable 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="TIE19" description="Transmission Interrupt Enable 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="TIE20" description="Transmission Interrupt Enable 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="TIE21" description="Transmission Interrupt Enable 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="TIE22" description="Transmission Interrupt Enable 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="TIE23" description="Transmission Interrupt Enable 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="TIE24" description="Transmission Interrupt Enable 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="TIE25" description="Transmission Interrupt Enable 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="TIE26" description="Transmission Interrupt Enable 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="TIE27" description="Transmission Interrupt Enable 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="TIE28" description="Transmission Interrupt Enable 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="TIE29" description="Transmission Interrupt Enable 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="TIE30" description="Transmission Interrupt Enable 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="TIE31" description="Transmission Interrupt Enable 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXBCIE" width="32" page="1" offset="0xE4" internal="0" description="MCAN Tx Buffer Cancellation Finished Interrupt Enable">
		<bitfield id="CFIE0" description="Cancellation Finished Interrupt Enable 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CFIE1" description="Cancellation Finished Interrupt Enable 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CFIE2" description="Cancellation Finished Interrupt Enable 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CFIE3" description="Cancellation Finished Interrupt Enable 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CFIE4" description="Cancellation Finished Interrupt Enable 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CFIE5" description="Cancellation Finished Interrupt Enable 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CFIE6" description="Cancellation Finished Interrupt Enable 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CFIE7" description="Cancellation Finished Interrupt Enable 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CFIE8" description="Cancellation Finished Interrupt Enable 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CFIE9" description="Cancellation Finished Interrupt Enable 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CFIE10" description="Cancellation Finished Interrupt Enable 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CFIE11" description="Cancellation Finished Interrupt Enable 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CFIE12" description="Cancellation Finished Interrupt Enable 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CFIE13" description="Cancellation Finished Interrupt Enable 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CFIE14" description="Cancellation Finished Interrupt Enable 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CFIE15" description="Cancellation Finished Interrupt Enable 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CFIE16" description="Cancellation Finished Interrupt Enable 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CFIE17" description="Cancellation Finished Interrupt Enable 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CFIE18" description="Cancellation Finished Interrupt Enable 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CFIE19" description="Cancellation Finished Interrupt Enable 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CFIE20" description="Cancellation Finished Interrupt Enable 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CFIE21" description="Cancellation Finished Interrupt Enable 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CFIE22" description="Cancellation Finished Interrupt Enable 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CFIE23" description="Cancellation Finished Interrupt Enable 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CFIE24" description="Cancellation Finished Interrupt Enable 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CFIE25" description="Cancellation Finished Interrupt Enable 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CFIE26" description="Cancellation Finished Interrupt Enable 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CFIE27" description="Cancellation Finished Interrupt Enable 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CFIE28" description="Cancellation Finished Interrupt Enable 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CFIE29" description="Cancellation Finished Interrupt Enable 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CFIE30" description="Cancellation Finished Interrupt Enable 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CFIE31" description="Cancellation Finished Interrupt Enable 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXEFC" width="32" page="1" offset="0xF0" internal="0" description="MCAN Tx Event FIFO Configuration">
		<bitfield id="EFSA" description="Event FIFO Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="EFS" description="Event FIFO Size" begin="21" end="16" width="6" rwaccess="RW"/>
		<bitfield id="EFWM" description="Event FIFO Watermark" begin="29" end="24" width="6" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXEFS" width="32" page="1" offset="0xF4" internal="0" description="MCAN Tx Event FIFO Status">
		<bitfield id="EFFL" description="Event FIFO Fill Level" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="EFGI" description="Event FIFO Get Index" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="EFPI" description="Event FIFO Put Index" begin="20" end="16" width="5" rwaccess="R"/>
		<bitfield id="EFF" description="Event FIFO Full" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="TEFL" description="Tx Event FIFO Element Lost" begin="25" end="25" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_TXEFA" width="32" page="1" offset="0xF8" internal="0" description="MCAN Tx Event FIFO Acknowledge">
		<bitfield id="EFAI" description="Event FIFO Acknowledge Index" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
</module>
